/* Практическое задание №1.
Задача 1. Выбросить случайное целое число в диапазоне от 0 до 2000 и сохранить в i.

Пункты реализовать в методе main
*Пункты реализовать в разных методах
int i = new Random().nextInt(k); //это кидалка случайных чисел!) */
package sem1;

import java.util.Random;

public class z1 {
    public static void main(String[] args) {
        Random rand = new.Random().nextInt(2000);
        int i = new Random(2000);
        System.out.println (i); 
    }
}

